"""""""""ЗАДАЧА 4  - стр. 130 """""""""
# сравняване за еднаквост на списъци, по дължина и съвпадение на елементи

# Въвеждане на първия списък от числа
list1 = list(map(int, input("Въведете първия списък от числа, разделени със запетайка: ").split(',')))

# Въвеждане на втория списък от числа
list2 = list(map(int, input("Въведете втория списък от числа, разделени със запетайка: ").split(',')))

# Проверка за равенство на списъците
if len(list1) != len(list2):
    print("Списъците не са еднакви по дължина.")
else:
    are_equal = all(x == y for x, y in zip(list1, list2))
    if are_equal:
        print("Списъците са еднакви.")
    else:
        print("Списъците не са еднакви.")
