"""""""""ЗАДАЧА 10  - стр. 131 """""""""

# Напишете програма за формулата Ax = B - A - 1
# А и В се въвеждат
# Уравнението има решение  x = (B-1) / A - 1 ако A != 0
# A == 0 and B == 1  решение е всяко число
# A == 0 and B != 1 уравнението няма решение

try:
    numbers = [int(input("Въведете първото число: ")), int(input("Въведете второто число: "))]
    if numbers[0] != 0:
        num_x= (numbers[1]-1) / numbers[0] -1
        print("Решение на уравнението е: x = (B-1) / A - 1 защото A != 0 -> ", num_x)
    elif numbers[0] == 0 and numbers[1] == 0:
        print("Решение е всяко число")
    elif numbers[0] == 0 and numbers[1] != 0:
        print("Уравнението няма решение")
except ValueError:
    print("Грешка: Въведете валидно цяло число.")
