print("Операции със списък с числа. Програмата дели [0]  на [3]")
# Контролируем код:
try:
    nums = eval(input("Въведете числов списък [a,b,c,d....]: "))
    print("Получена стойност: "+str(nums))
    a = int(nums[0])
    b = int(nums[3])
    print(str(a)+"/"+str(b)+"="+str(a/b))
# Обработка на изключения:
except ValueError:          # грешка свързана с преобразуване на въведена от потребителя стойност на целочислен формат
    print("ValueError: грешка при преобразуване!")

except ZeroDivisionError:   # грешка при опит за делене на нула
    print("ZeroDivisionError: опит за деление на нула!")

except TypeError:           # грешка при несъвместимост на типовете и при опит за изпълнение на некоректна операция
    print("TypeError: недопустима операция!")

except IndexError:          # грешно оказан индес на елементите от списъка
    print("IndexError: неверен индекс на елемента!")

except SyntaxError:         # грашка на клас, възниква при опит за изчисление на некорекен израз
    print("SyntaxError: невъзможно е изразът да бъде изчислен!")

except NameError:           # неправилно обръщение към променлива, или към несъществуваща променлива
                            # - променлива на която предварително не е била присвоена стойност
    print("NameError: неверен идентификатор!")

print("Край на програмата.")
