#  стр. 113
koko = eval(input("input :"))
val = koko

a, b = (val[0], val[-1]) if type(val) == str else (val, type(val))
print(a)
print(b)


# eval() е вградена функция на Python, която се използва за динамично оценяване на низ като израз или инструкция на Python.
# Той приема низ като аргумент, интерпретира го като част от код на Python и след това изпълнява този код.
# Ето основно обяснение как работи eval():

# Предавайте низ на eval():
# Предоставяте низ на функцията eval() и този низ трябва да съдържа валиден израз или оператор на Python.
# Например, можете да предавате математически изрази, присвоявания, извиквания на функции или друг код на Python като низ.

# Оценка:
# след това eval() оценява низа като код на Python.

# Изпълнение:
# Ако низът е валиден израз на Python, eval() изчислява стойността му и я връща.
# Ако низът е валиден оператор на Python, той изпълнява израза и връща резултата (ако има такъв).
# За да се получи резултат от изчислението текст /string/,  трябва да въведем не Python  а "Pyton". ако се въведе само
# Python той няма смисъл за Ентерпретатора защото той прави опит за изчисляв3ане на скрития текст.
