#Тази програма реализира Колатцовата последователност за дадено цяло число,
# въведено от потребителя. Колатцовата последователност,
# известна още като "проблем на 3n + 1", е последователност от числа,
# където за дадено число n:
# - Ако n е четно, го разделяме на 2 (н = н / 2).
# - Ако n е нечетно, умножаваме го по 3 и добавяме 1 (н = 3 * н + 1).
# Програмата приема цяло число от потребителя, след което извежда
# Колатцовата последователност за това число, като включва и самото въведено число и
# всички последващи стойности, докато последният елемент на последователността стане 1.
#  5 нечетно *3+1 -> четно 16 /2 -> четно 8 /2 -> четно 4 /2 -> четно 2/2 -> 1

count_colletz = 0
def collatz(n):
    global count_colletz  # Използвайте global за да може да промените стойността на глобалната променлива
    inc = 1
    c = []
    c.append(n)

    while n > 1:
        if n % 2 == 0:
            n = n / 2
        else:
            n = (3 * n) + 1
        c.append(n)
        count_colletz += 1  # Увеличаване на брояча
    return c

while True:
    count_colletz = 0 # Нулиране на брояча
    j = int(input("\nEnter the digit: "))
    print(collatz(j))
    print(f"{count_colletz} операции")
    repeat = input("Искате ли да повторите (Y/N)? ")
    if repeat.upper() == "N":
        print("Благодаря!")
        break
